In [1]:
import numpy

In [2]:
numpy.sum([10, 20, 30])

60

In [3]:
numpy.mean([10, 20, 30, 40, 55])

31.0

In [6]:
numpy.max([10, 20, 30 , 40, 55])

55

In [5]:
numpy.min([10, 20, 30 , 40, 55])

10

In [21]:
import pandas as pd
df = pd.read_csv("C:/Users/Admin/Documents/Datasets/emp_h.csv")

In [23]:
q = ["EMPID", "NAME", "CITY", "SAL"]
df = pd.read_csv("C:/Users/Admin/Documents/Datasets/emp_h.csv", names=q)

In [25]:
df = pd.read_csv("C:/Users/Admin/Documents/Datasets/emp_h.csv", header=None)

In [31]:
df = pd.read_csv("C:/Users/Admin/Documents/Datasets/emp_h.csv", header=None, names=q)

In [33]:
df = pd.read_csv("C:/Users/Admin/Documents/Datasets/emp_h.csv", header=None, skiprows=1, names=q)

In [34]:
df

   EMPID     NAME     CITY              SAL
0    101   Akshat     Pune        200000000
1    102    Manan   Bhopal         30000000
2    103     Anup   Bhopal       7000000000
3    104    Suraj     Pune  800000000000000
4    105   Yogesh     Pune  878784683584756

In [35]:
df.describe()

            EMPID           SAL
count    5.000000  5.000000e+00
mean   103.000000  3.357584e+14
std      1.581139  4.605958e+14
min    101.000000  3.000000e+07
25%    102.000000  2.000000e+08
50%    103.000000  7.000000e+09
75%    104.000000  8.000000e+14
max    105.000000  8.787847e+14

In [36]:
df.iloc[:, :]

   EMPID     NAME     CITY              SAL
0    101   Akshat     Pune        200000000
1    102    Manan   Bhopal         30000000
2    103     Anup   Bhopal       7000000000
3    104    Suraj     Pune  800000000000000
4    105   Yogesh     Pune  878784683584756

In [40]:
50 startups wali csv----------
df.iloc[0:6, 0:3]

   EMPID     NAME     CITY
0    101   Akshat     Pune
1    102    Manan   Bhopal
2    103     Anup   Bhopal
3    104    Suraj     Pune
4    105   Yogesh     Pune